export const eventTypes = [
  {
    emoji: "🦸",
    name: "Квест",
    description: "Оффлайн активность с выполнением заданий и вознаграждением",
    bgColor: "bg-purple-100",
  },
  {
    emoji: "💁‍♂️",
    name: "Конференция",
    description: "Вы хотите пригласить людей на серию лекций по определённой специфике.",
    bgColor: "bg-purple-100",
  },
  {
    emoji: "💬",
    name: "Нетворкинг",
    description: "Это может обычная беседе в кафе или в другом общественном месте.",
    bgColor: "bg-purple-100",
  },
  {
    emoji: "🎉",
    name: "Вечеринка",
    description: "Совместный отдых и веселье",
    bgColor: "bg-purple-100",
  },
  {
    emoji: "📽️",
    name: "Кино",
    description: "Совместный поход в кино",
    bgColor: "bg-purple-100",
  },
  {
    emoji: "🤜 🤛",
    name: "Совместное посещение",
    description: "Совместный поход на существующее событие",
    bgColor: "bg-purple-100",
  },
];
