export const questsData = [
  {
    id: 1,
    title: "Квест «Дизайнер»",
    description:
      "Квест направленный на повышение практических навыков и знаний среди дизайнеров интерфейсов",
    date: "19 декабря",
    location: "г.Караганда",
    price: 15000,
    type: "Глобальный",
    category: "Обучающий",
    stages: [
      {
        title: "Этап 1: Анализ пользователей",
        desc: "Изучите целевую аудиторию и создайте персоны пользователей",
      },
      {
        title: "Этап 2: Создание wireframes",
        desc: "Разработайте базовую структуру интерфейса и навигацию",
      },
      {
        title: "Этап 3: Финальный дизайн",
        desc: "Создайте финальный макет с учетом всех требований и фидбека",
      },
    ],
    reward: 200,
    hasAchievement: true,
    organizer: "Дизайнер",
    image:
      "https://images.unsplash.com/photo-1581291518857-4e27b48ff24e?w=88&h=88&fit=crop&crop=center",
  },
  {
    id: 2,
    title: 'Голливудский квест в горах: "Охота за Золотым Сердцем"',
    description:
      "Семья отправляется в горы на отдых, но их приключение принимает неожиданный поворот.",
    date: "20 декабря",
    location: "г.Караганда",
    price: 15000,
    type: "Глобальный",
    category: "Тематический",
    stages: [
      {
        title: "Этап 1: Анализ пользователей",
        desc: "Изучите целевую аудиторию и создайте персоны пользователей",
      },
      {
        title: "Этап 2: Создание wireframes",
        desc: "Разработайте базовую структуру интерфейса и навигацию",
      },
      {
        title: "Этап 3: Финальный дизайн",
        desc: "Создайте финальный макет с учетом всех требований и фидбека",
      },
    ],
    reward: 20000,
    hasAchievement: false,
    organizer: "Голливуд",
    image:
      "https://images.unsplash.com/photo-1506905925346-21bda4d32df4?w=88&h=88&fit=crop&crop=center",
  },
  {
    id: 3,
    title: "Чистый район",
    description:
      'Город погрузился в хаос мусора! Загадочные "Хранители Чистоты" отправляют команды добровольцев на миссию по спасению своего района. У вас есть всего несколько часов, чтобы очистить территорию, найти спрятанные артефакты чистоты и выполнить особые задания.',
    date: "20 декабря",
    location: "г.Караганда",
    price: 15000,
    type: "Ежедневный",
    organizer: "Чистый район",
    category: "Хелп-квест",
    reward: 2500,
    hasAchievement: true,
    stages: [
      {
        title: "Этап 1: Анализ пользователей",
        desc: "Изучите целевую аудиторию и создайте персоны пользователей",
      },
      {
        title: "Этап 2: Создание wireframes",
        desc: "Разработайте базовую структуру интерфейса и навигацию",
      },
      {
        title: "Этап 3: Финальный дизайн",
        desc: "Создайте финальный макет с учетом всех требований и фидбека",
      },
    ],
    image:
      "https://images.unsplash.com/photo-1558618666-fcd25c85cd64?w=88&h=88&fit=crop&crop=center",
  },
  {
    id: 4,
    title: "Повышаем коммуникационные навыки",
    description:
      "Участникам предлагается помочь детскому приюту собрать подарки и провести мастер-классы для детей. Это социальный проект, который объединяет людей вокруг благотворительности.",
    date: "23 декабря",
    location: "г.Караганда",
    price: 15000,
    type: "Ежедневный",
    organizer: "Детский приют",
    category: "Саморазвитие",
    reward: 15000,
    hasAchievement: false,
    stages: [
      {
        title: "Этап 1: Анализ пользователей",
        desc: "Изучите целевую аудиторию и создайте персоны пользователей",
      },
      {
        title: "Этап 2: Создание wireframes",
        desc: "Разработайте базовую структуру интерфейса и навигацию",
      },
      {
        title: "Этап 3: Финальный дизайн",
        desc: "Создайте финальный макет с учетом всех требований и фидбека",
      },
    ],
    image:
      "https://images.unsplash.com/photo-1517486808906-6ca8b3f04846?w=88&h=88&fit=crop&crop=center",
  },
];
